/*
ษออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออป
บ                                                                            บ
บ File:    VERSION.C                                                         บ
บ Author:  Jack Miller                                                       บ
บ                                                                            บ
ฬออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออน
บ                                                                            บ
บ   Version number                                                           บ
บ                                                                            บ
ฬออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออน
บ HISTORY:                                                                   บ
บ                                                                            บ
บ  28Jan97 JVM  0.1b Changed 3DFX dot clock frequency to 45Mhz.              บ
บ  28Jan97 JVM  0.1a First version for Blitz.                                บ
บ                                                                            บ
ศออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออผ
*/
#include <compiler.h>
#include "version.h"


const _POST_VERSION  _ver = { 0, 1, 'b' };
